<template>
  <svg
   id="uuid-4f64e782-32c0-402b-a44a-dfd2ba13a151"
   viewBox="0 0 218.34801 218.34801"
   version="1.1"
   :width="size"
   :height="size"
   xmlns="http://www.w3.org/2000/svg"
   xmlns:svg="http://www.w3.org/2000/svg">
  <defs
     id="defs9" />
  <rect
     x="0"
     y="0"
     width="218.34801"
     height="218.34801"
     rx="63.179001"
     ry="63.179001"
     :fill="props.color ? props.color : '#e31e27'"
     id="rect2" />
  <path
     d="m 109.24,29.544999 c -43.94,0 -79.563,35.623 -79.563,79.563001 0,33.724 20.955,62.537 50.554,74.128 -0.72,-6.287 -1.31,-15.978 0.262,-22.854 1.441,-6.221 9.299,-39.552 9.299,-39.552 0,0 -2.357,-4.78 -2.357,-11.787 0,-11.067001 6.417,-19.318001 14.406,-19.318001 6.81,0 10.085,5.108 10.085,11.198001 0,6.81 -4.322,17.026 -6.614,26.521 -1.899,7.924 3.994,14.407 11.787,14.407 14.144,0 25.015,-14.93 25.015,-36.409 0,-19.056001 -13.686,-32.349001 -33.266,-32.349001 -22.657,0 -35.951,16.96 -35.951,34.510001 0,6.81 2.619,14.144 5.894,18.139 0.655,0.786 0.72,1.506 0.524,2.292 -0.589,2.489 -1.965,7.924 -2.226,9.037 -0.327,1.441 -1.179,1.768 -2.685,1.048 -9.954,-4.649 -16.175,-19.121 -16.175,-30.843 0,-25.080001 18.205,-48.131001 52.584,-48.131001 27.569,0 49.048,19.645 49.048,45.970001 0,27.438 -17.288,49.506 -41.255,49.506 -8.054,0 -15.651,-4.191 -18.205,-9.168 0,0 -3.995,15.192 -4.977,18.925 -1.768,6.941 -6.614,15.585 -9.888,20.889 7.465,2.292 15.323,3.536 23.574,3.536 43.94,0 79.563,-35.623 79.563,-79.563 0.131,-44.071001 -35.492,-79.694001 -79.432,-79.694001 z"
     :fill="props.color ? textColor : '#ffffff'"
     id="path4" />
</svg>
</template>

<script setup lang="ts">
import { computed } from 'vue'

interface Props {
  size?: number | string
  filled?: boolean
  color?: string
}

const props = withDefaults(defineProps<Props>(), {
  size: 24,
  filled: false,
  color: ''
})

// تابع برای تشخیص رنگ سفید
const isWhiteColor = (color: string): boolean => {
  if (!color || color === "transparent") return false
  
  // حذف # از ابتدای رنگ hex
  const hex = color.replace("#", "").toLowerCase()
  
  // بررسی اینکه رنگ سفید باشد
  return hex === "ffffff" || hex === "fff" || color.toLowerCase() === "white"
}

// تعیین رنگ متن بر اساس رنگ پس‌زمینه
const textColor = computed(() => {
  if (!props.color) return '#ffffff' // رنگ پیش‌فرض سفید
  return isWhiteColor(props.color) ? '#000000' : '#ffffff'
})
</script>