<?php
return [
    'validation_failed' => 'داده‌های ارسال‌شده نامعتبر هستند.',
    'user_not_found' => 'کاربر یافت نشد.',
    'card_setting_missing' => 'تنظیمات کارت تجاری موجود نیست.',
    'unauthorized' => 'شما مجوز لازم برای انجام این عملیات را ندارید.',
    'unexpected_error' => 'مشکلی در پردازش درخواست رخ داده است. لطفاً دوباره امتحان کنید.',
    'card_creation_restricted' => 'شما مجوز ایجاد کارت تجاری جدید را ندارید.',
    'card_creation_failed' => 'مشکلی در ایجاد کارت تجاری رخ داده است.',
    'invalid_card_data' => 'داده‌های کارت نامعتبر هستند.',
    'media_not_found' => 'رسانه‌ای برای این کارت تجاری پیدا نشد.',
    'profile_not_found' => 'پروفایل کارت تجاری یافت نشد.',
    'link_not_found' => 'لینک موردنظر یافت نشد.',
    'no_links_found' => 'هیچ لینکی برای این پروفایل موجود نیست.',

];

